examples/verification/harmonicsFilter/0/p_Filter_var0_filter1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_Filter_var0_filter1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2500
(
0.125
0.125
0.125
0.125
0.125
0.125
0.125
0.125
...
)
;

boundaryField
{
    patch0_half0
    {
        type            cyclic;
    }
    patch0_half1
    {
        type            cyclic;
    }
    patch1_half0
    {
        type            cyclic;
    }
    patch1_half1
    {
        type            cyclic;
    }
    patch2_half0
    {
        type            cyclic;
    }
    patch2_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
