examples/verification/harmonicsFilter/Allrun
#!/bin/sh
rm 0/*
cp 0.init/* 0/.
blockMesh

meshFilter

# ----------------------------------------------------------------- end-of-file
